CSI API ETABS v1
cDesignConcreteSlab.GetSummaryResultsFlexureAndShear Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSummaryResultsFlexureAndShear(
	ref string[] StoryName,
	ref string[] DesignStripName,
	ref string[] SpanID,
	ref string[] Location,
	ref string[] FTopCombo,
	ref double[] FTopMoment,
	ref double[] FTopArea,
	ref string[] FBotCombo,
	ref double[] FBotMoment,
	ref double[] FBotArea,
	ref string[] VCombo,
	ref double[] VForce,
	ref double[] VArea,
	ref string[] Status,
	ref string[] Layer
)
Function GetSummaryResultsFlexureAndShear (
	ByRef StoryName As String(),
	ByRef DesignStripName As String(),
	ByRef SpanID As String(),
	ByRef Location As String(),
	ByRef FTopCombo As String(),
	ByRef FTopMoment As Double(),
	ByRef FTopArea As Double(),
	ByRef FBotCombo As String(),
	ByRef FBotMoment As Double(),
	ByRef FBotArea As Double(),
	ByRef VCombo As String(),
	ByRef VForce As Double(),
	ByRef VArea As Double(),
	ByRef Status As String(),
	ByRef Layer As String()
) As Integer
Dim instance As cDesignConcreteSlab
Dim StoryName As String()
Dim DesignStripName As String()
Dim SpanID As String()
Dim Location As String()
Dim FTopCombo As String()
Dim FTopMoment As Double()
Dim FTopArea As Double()
Dim FBotCombo As String()
Dim FBotMoment As Double()
Dim FBotArea As Double()
Dim VCombo As String()
Dim VForce As Double()
Dim VArea As Double()
Dim Status As String()
Dim Layer As String()
Dim returnValue As Integer
returnValue = instance.GetSummaryResultsFlexureAndShear(StoryName,
	DesignStripName, SpanID, Location,
	FTopCombo, FTopMoment, FTopArea,
	FBotCombo, FBotMoment, FBotArea,
	VCombo, VForce, VArea, Status, Layer)
int GetSummaryResultsFlexureAndShear(
	array<String^>^% StoryName,
	array<String^>^% DesignStripName,
	array<String^>^% SpanID,
	array<String^>^% Location,
	array<String^>^% FTopCombo,
	array<double>^% FTopMoment,
	array<double>^% FTopArea,
	array<String^>^% FBotCombo,
	array<double>^% FBotMoment,
	array<double>^% FBotArea,
	array<String^>^% VCombo,
	array<double>^% VForce,
	array<double>^% VArea,
	array<String^>^% Status,
	array<String^>^% Layer
)
abstract GetSummaryResultsFlexureAndShear :
        StoryName : string[] byref *
        DesignStripName : string[] byref *
        SpanID : string[] byref *
        Location : string[] byref *
        FTopCombo : string[] byref *
        FTopMoment : float[] byref *
        FTopArea : float[] byref *
        FBotCombo : string[] byref *
        FBotMoment : float[] byref *
        FBotArea : float[] byref *
        VCombo : string[] byref *
        VForce : float[] byref *
        VArea : float[] byref *
        Status : string[] byref *
        Layer : string[] byref -> int
Parameters
StoryName
Type: System.String[]
DesignStripName
Type: System.String[]
SpanID
Type: System.String[]
Location
Type: System.String[]
FTopCombo
Type: System.String[]
FTopMoment
Type: System.Double[]
FTopArea
Type: System.Double[]
FBotCombo
Type: System.String[]
FBotMoment
Type: System.Double[]
FBotArea
Type: System.Double[]
VCombo
Type: System.String[]
VForce
Type: System.Double[]
VArea
Type: System.Double[]
Status
Type: System.String[]
Layer
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDesignConcreteSlab Interface
ETABSv1 Namespace